toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    // Task stack
    [[gnu::section(".stack._TaskImg")]]
    alignas(void*)
    static inline uint8_t Stack[256];
};

struct _TaskMain {
    static void Start() {
        _Scheduler::Start<_TaskMain>();
    }
    
    static void Reset() {
        // Reset our state
        _Power = {};
        _TrigSrc = _TriggerSources::None;
        // Reset other tasks' state
        // This is necessary because we're stopping them at an arbitrary point
        _TaskSD::Init();
        _TaskImg::Init();
        // Stop tasks
        _Scheduler::Stop<_TaskSD>();
        _Scheduler::Stop<_TaskImg>();
        _Scheduler::Stop<_TaskMain>();
        // Turn off power
        _VDDIMGSDSet(false);
        _VDDBSet(false);
    }
    
//    using _TriggerSource = uint8_t;
//    struct _TriggerSources {
//        static constexpr _TriggerSource None    = 0;
//        static constexpr _TriggerSource Motion  = 1<<0;
//        static constexpr _TriggerSource Manual  = 1<<1;
//    };
    
//    static _TriggerSource _TriggerPoll() {
//        const _TriggerSource x = _TrigSrc;
//        _TrigSrc = _TriggerSources::None;
//        return x;
//    }
    
//    static void ManualTrigger() {
//        _TrigSrc |= _TriggerSources::Manual;
//    }
    
    static void _TimeTrigger(Events::Event& ev) {
        Events::Event& captureEv = _Events.time(ev).captureEv;
        Events::Capture& capture = _Events.capture(captureEv);
        MSP::State::Events::Capture& captureBase = _Events.base(capture);
        // Reset capture count
        captureEv.time = 0;
        capture.countRem = captureBase.count;
        // Push the capture event
        _Events.push(captureEv);
    }
    
    static void _CaptureImage(Events::Event& ev) {
        auto& capture = _Events.capture(ev);
        const auto& base = _Events.base(capture);
        
        // Turn on VDD_B power (turns on ICE40)
        _VDDBSet(true);
        
        // Wait for ICE40 to start
        // We specify (within the bitstream itself, via icepack) that ICE40 should load
        // the bitstream at high-frequency (40 MHz).
        // According to the datasheet, this takes 70ms.
        _Scheduler::Sleep(_Scheduler::Ms(30));
        _ICEInit();
        
        // Reset SD nets before we turn on SD power
        _TaskSD::CardReset();
        _TaskSD::Wait();
        
        // Turn on IMG/SD power
        _VDDIMGSDSet(true);
        
        // Init image sensor / SD card
        _TaskImg::SensorInit();
        _TaskSD::CardInit();
        
        // Capture an image
        {
            // Wait for _TaskSD to be initialized and done with writing, which is necessary
            // for 2 reasons:
            //   1. we have to wait for _TaskSD to initialize _State.sd.imgRingBufs before we
            //      access it,
            //   2. we can't initiate a new capture until writing to the SD card (from a
            //      previous capture) is complete (because the SDRAM is single-port, so
            //      we can only read or write at one time)
            _TaskSD::WaitForInitAndWrite();
            
            // Capture image to RAM
            _TaskImg::Capture(imgRingBuf.buf.id);
            const uint8_t srcRAMBlock = _TaskImg::CaptureBlock();
            
            // Copy image from RAM -> SD card
            _TaskSD::Write(srcRAMBlock);
            _TaskSD::Wait();
        }
        
//            for (;;) {
//                // Capture an image
//                {
//                    // Wait for _TaskSD to be initialized and done with writing, which is necessary
//                    // for 2 reasons:
//                    //   1. we have to wait for _TaskSD to initialize _State.sd.imgRingBufs before we
//                    //      access it,
//                    //   2. we can't initiate a new capture until writing to the SD card (from a
//                    //      previous capture) is complete (because the SDRAM is single-port, so
//                    //      we can only read or write at one time)
//                    _TaskSD::WaitForInitAndWrite();
//                    
//                    // Capture image to RAM
//                    _TaskImg::Capture(imgRingBuf.buf.id);
//                    const uint8_t srcRAMBlock = _TaskImg::CaptureBlock();
//                    
//                    // Copy image from RAM -> SD card
//                    _TaskSD::Write(srcRAMBlock);
//                    _TaskSD::Wait();
//                }
//                
//                break;
//                
////                // Wait up to 1s for further motion
////                const auto motion = _Scheduler::Wait(_Scheduler::Ms(1000), [] { return (bool)_Motion; });
////                if (!motion) break;
////                
////                // Only reset _Motion if we've observed motion; otherwise, if we always reset
////                // _Motion, there'd be a race window where we could first observe
////                // _Motion==false, but then the ISR sets _Motion=true, but then we clobber
////                // the true value by resetting it to false.
////                _Motion = false;
//            }
//        
//        if (trigger & _TriggerSources::Manual) {
//            _LEDRed_::Set(_LEDPriority::Capture, 1);
//        }
        
        _VDDIMGSDSet(false);
        _VDDBSet(false);
        
        capture.countRem--;
        if (capture.countRem) {
            ev.time = _RTC::TimeRead() + ((_Time::Instant)base.delayMs)*1000;
            _Events.push(ev);
        }
    }
    
    static void _MotionEnable(Events::Event& ev) {
        Events::Motion& motion = _Events.motion(ev);
        motion.enabled.acquire();
    }
    
    static void _MotionDisable(Events::Event& ev) {
        Events::Motion& motion = _Events.motion(ev);
        motion.enabled.release();
    }
    
    static void _MotionUnsuppress(Events::Event& ev) {
        Events::Motion& motion = _Events.motion(ev);
        motion.enabled.suppress(false);
    }
    
