toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    static void Run() {
//        for (bool x=false;; x=!x) {
//            _Pin::LED_RED_::Write(x);
//            _BatterySampler::Sample();
//            _Scheduler::Sleep(_Scheduler::Ms(1000));
//        }
        
//        // Handle cold starts
//        if (!_FirstRunDone) {
//            _FirstRunDone = true;
//            // Since this is a cold start, delay 3s before beginning.
//            // This delay is meant for the case where we restarted due to an abort, and
//            // serves 2 purposes:
//            //   1. it rate-limits aborts, in case there's a persistent issue
//            //   2. it allows GPIO outputs to settle, so that peripherals fully turn off
//            _LEDRed_::Set(_LEDRed_::Priority::Low, 0);
//            _Scheduler::Sleep(_Scheduler::Ms(3000));
//            _LEDRed_::Set(_LEDRed_::Priority::Low, 1);
//        }
//        
//        _Scheduler::Sleep(_Scheduler::Ms(10000));
        
//        _Pin::VDD_B_EN::Write(1);
//        _Scheduler::Sleep(_Scheduler::Ms(250));
//        
//        for (;;) {
//            _ICE::Transfer(_ICE::LEDSetMsg(0xFF));
//            _Scheduler::Sleep(_Scheduler::Ms(250));
//            
//            _ICE::Transfer(_ICE::LEDSetMsg(0x00));
//            _Scheduler::Sleep(_Scheduler::Ms(250));
//        }
        
//        for (;;) {
//            _Scheduler::Sleep(_Scheduler::Ms(1000));
//        }
        
        const MSP::ImgRingBuf& imgRingBuf = _State.sd.imgRingBufs[0];
        
        // Reset our state
        Reset();
        
        // Init SPI peripheral
        _SPI::Init();
        
        for (;;) {
//            // Wait for motion. During this block we allow LPM3.5 sleep, as long as our other tasks are idle.
//            {
//                _WaitingForMotion = true;
//                _Scheduler::Wait([&] { return (bool)_Motion; });
//                _Motion = false;
//                _WaitingForMotion = false;
//            }
            
            // Wait until we're triggered to capture an image
            static Events::Event* ev = nullptr;
            _Scheduler::Wait([] { return ev = _Events.pop(); });
            
            // Stay powered while we handle the event
            _Power.acquire();
            
            using T = Events::Event::Type;
            switch (ev->type) {
            case T::TimeTrigger:
                _TimeTrigger(*ev);
                break;
            case T::CaptureImage:
                _CaptureImage(*ev);
                break;
            case T::MotionEnable:
                _MotionEnable(*ev);
                break;
            case T::MotionDisable:
                _MotionDisable(*ev);
                break;
            case T::MotionUnsuppress:
                _MotionUnsuppress(*ev);
                break;
            }
            
//            // Light the red LED if this is a manual trigger
//            if (trigger & _TriggerSources::Manual) {
//                _LEDRed_::Set(_LEDPriority::Capture, 0);
//            }
            
            // Release power assertion
            _Power.release();
            
//            // Release control of the LED
//            _LEDRed_::Set(_LEDPriority::Capture, std::nullopt);
        }
    }
    
//    static void _Init() {
//        // Reset our shared state
//        // This is used to init our task after it's been stopped in an arbitrary state.
//        _Motion = false;
//    }
//    
//    static bool DeepSleepOK() {
//        // Permit LPM3.5 if we're waiting for motion, and neither of our tasks are doing anything.
//        // This logic works because if _WaitingForMotion==true, then we've disabled both _TaskSD
//        // and _TaskImg, so if the tasks are idle, then everything's idle so we can enter deep
//        // sleep. (The case that we need to be careful of is going to sleep when either _TaskSD
//        // or _TaskImg is idle but still powered on, which the _WaitingForMotion check takes
//        // care of.)
//        return _WaitingForMotion                &&
//               !_Scheduler::Running<_TaskSD>()  &&
//               !_Scheduler::Running<_TaskImg>() ;
//    }
    
    static void ISR_MotionSignal(uint16_t iv) {
        _TrigSrc |= _TriggerSources::Motion;
    }
    
//    // _Init: stores whether this is the first
//    [[gnu::section(".ram_backup.main")]]
//    static inline bool _FirstRunDone = false;
//    
//    // _MotionTrigger: announces that motion occurred
//    static volatile inline bool _MotionTrigger = false;
//    
//    // _ManualTrigger: manual capture trigger
//    static volatile inline bool _ManualTrigger = false;
    
    static volatile inline _TriggerSource _TrigSrc = _TriggerSources::None;
    
    static inline _PowerAssertion _Power;
    
    // Task stack
    [[gnu::section(".stack._TaskMain")]]
    alignas(void*)
    static inline uint8_t Stack[256];
};

static void _CapturePause() {
    _TaskMain::Reset();
}

static void _CaptureResume() {
    _TaskMain::Start();
}

struct _TaskI2C {
    static void Run() {
        for (;;) {
            // Wait until the I2C lines are activated (ie VDD_B_3V3_STM becomes powered)
            _I2C::WaitUntilActive();
            
            // Maintain power while I2C is active
            _PowerAssertion power;
            power.acquire();
            
            for (;;) {
                // Wait for a command
                MSP::Cmd cmd;
                bool ok = _I2C::Recv(cmd);
                if (!ok) break;
                
                // Handle command
                const MSP::Resp resp = _CmdHandle(cmd);
                
                // Send response
                ok = _I2C::Send(resp);
                if (!ok) break;
            }
            
            // Cleanup
            
//            // Relinquish LEDs, which may have been set by _CmdHandle()
            _LEDRed_::Set(_LEDPriority::I2C, std::nullopt);
            _LEDGreen_::Set(_LEDPriority::I2C, std::nullopt);
            
            // Release capture-pause assertion if it was held
            _HostMode = {};
        }
    }
    
    static MSP::Resp _CmdHandle(const MSP::Cmd& cmd) {
        using namespace MSP;
        switch (cmd.op) {
        case Cmd::Op::StateRead: {
            const size_t off = cmd.arg.StateRead.chunk * sizeof(MSP::Resp::arg.StateRead.data);
            if (off > sizeof(_State)) return MSP::Resp{ .ok = false };
            const size_t rem = sizeof(_State)-off;
            const size_t len = std::min(rem, sizeof(MSP::Resp::arg.StateRead.data));
            MSP::Resp resp = { .ok = true };
            memcpy(resp.arg.StateRead.data, (uint8_t*)&_State+off, len);
            return resp;
        }
        
        case Cmd::Op::StateWrite: {
            const size_t off = cmd.arg.StateWrite.chunk * sizeof(MSP::Cmd::arg.StateWrite.data);
            if (off > sizeof(_State)) return MSP::Resp{ .ok = false };
            const size_t rem = sizeof(_State)-off;
            const size_t len = std::min(rem, sizeof(MSP::Cmd::arg.StateWrite.data));
            memcpy((uint8_t*)&_State+off, cmd.arg.StateWrite.data, len);
            return MSP::Resp{ .ok = true };
        }
        
        case Cmd::Op::LEDSet:
            _LEDRed_::Set(_LEDPriority::I2C, !cmd.arg.LEDSet.red);
            _LEDGreen_::Set(_LEDPriority::I2C, !cmd.arg.LEDSet.green);
            return MSP::Resp{ .ok = true };
        
